# web - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.data.vercel_project_directory.default: Reading...
module.common_resources.random_password.nextauthsecret: Refreshing state... [id=none]
module.common_resources.data.vercel_project_directory.default: Read complete after 0s [id=../../../]
module.common_resources.data.aws_apigatewayv2_apis.location_api_api_gateway_id: Reading...
module.common_resources.data.aws_apigatewayv2_apis.team_api_api_gateway_id: Reading...
module.common_resources.data.aws_apigatewayv2_apis.customer_api_api_gateway_id: Reading...
module.common_resources.data.aws_apigatewayv2_apis.connect_api_api_gateway_id: Reading...
module.common_resources.data.aws_cognito_user_pools.user_pool: Reading...
module.common_resources.data.aws_apigatewayv2_apis.organization_api_api_gateway_id: Reading...
module.common_resources.data.aws_apigatewayv2_apis.identity_api_api_gateway_id: Reading...
module.common_resources.data.aws_apigatewayv2_apis.notification_api_api_gateway_id: Reading...
module.common_resources.data.aws_apigatewayv2_apis.gateway_api_api_gateway_id: Reading...
module.common_resources.data.aws_cognito_user_pools.user_pool: Read complete after 0s [id=production]
module.common_resources.aws_cognito_user_pool_client.default: Refreshing state... [id=3svd5kmfb4ve2nunpnsmaergk2]
module.common_resources.data.aws_apigatewayv2_apis.identity_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_api.identity_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_apis.connect_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_apis.team_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_api.connect_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_api.team_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_apis.gateway_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_api.gateway_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_apis.notification_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_api.notification_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_apis.location_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_apis.organization_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_api.location_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_api.organization_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_apis.customer_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_api.customer_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_api.identity_api_api_gateway: Read complete after 0s [id=flqsockou3]
module.common_resources.data.aws_apigatewayv2_api.location_api_api_gateway: Read complete after 0s [id=eo95e0ylb5]
module.common_resources.data.aws_apigatewayv2_api.connect_api_api_gateway: Read complete after 0s [id=av04mn3dt5]
module.common_resources.data.aws_apigatewayv2_api.notification_api_api_gateway: Read complete after 0s [id=fyked35v29]
module.common_resources.data.aws_apigatewayv2_api.organization_api_api_gateway: Read complete after 0s [id=f8a62hnynh]
module.common_resources.data.aws_apigatewayv2_api.team_api_api_gateway: Read complete after 0s [id=emhnz9os0f]
module.common_resources.data.aws_apigatewayv2_api.gateway_api_api_gateway: Read complete after 0s [id=tl8e52pohf]
module.common_resources.data.aws_apigatewayv2_api.customer_api_api_gateway: Read complete after 0s [id=cd22hd3nqj]
module.common_resources.vercel_project.default: Refreshing state... [id=prj_ElpLF9P9rDm1zKYmZgFqOjD8x9Ly]
module.common_resources.vercel_project_domain.default: Refreshing state... [id=new-production.connectilly.com]
module.common_resources.vercel_deployment.default: Refreshing state... [id=dpl_AadyLBwR9qTymRm5KmJVbxAWsKuT]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.common_resources.vercel_deployment.default must be replaced
-/+ resource "vercel_deployment" "default" {
      ~ domains     = [ # forces replacement
          - "new-production.connectilly.com",
          - "production-web-eight.vercel.app",
          - "production-web-connectilly.vercel.app",
          - "production-web-mortezaconnectilly-connectilly.vercel.app",
        ] -> (known after apply) # forces replacement
      ~ files       = { # forces replacement
          ~ "../../../infrastructure/workspaces/common_resources/resources.tf"                                = "7673~5bfc2644fcdc34d57fe6ab81f36a0d1c3800afe4" -> "7866~6ce5b91cb2ed928ca1390dc02f2b99119a901a2c"
          ~ "../../../package.json"                                                                           = "1373~93152c8815abf9eb7ee692e6580924010e176c1c" -> "1343~ad8bc61d7a561059d8aca2f01539a2d42a74910d"
          ~ "../../../src/libs/graphql/connectilly/index.ts"                                                  = "1704~aa39e53a947878e4f2c9dc05b136f3f9b67378a5" -> "1225~bb992795f2823da4bddeacfe28844a60c947ac0d"
          ~ "../../../src/pages/_app.tsx"                                                                     = "928~92544013607da6ae41a506a5bbd1da1b9da84db5" -> "1446~c24a9938f89e4e035251304f4bc8857f98de1342"
          ~ "../../../src/pages/index.tsx"                                                                    = "2614~5e460ffd15412f5ae77dec097965541d0b814324" -> "2105~36c67549175a3415115caad0e1b275bbe0b3cc08"
          ~ "../../../src/types/environment.d.ts"                                                             = "485~484b74d426dcb18b2b518a51c88cd2ac0ea3fb85" -> "529~2e6e1a7563298e17f74f2b6f6102327183fa07b8"
          ~ "../../../yarn.lock"                                                                              = "152646~c925ed05426875597c95e8f1b6ef0f5a0c79a80f" -> "151690~90b1fa9e36235c050325e95a62ecc84365d40de4"
            # (146 unchanged elements hidden)
        }
      ~ id          = "dpl_AadyLBwR9qTymRm5KmJVbxAWsKuT" -> (known after apply)
      ~ url         = "production-13yaqln8r-connectilly.vercel.app" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.common_resources.vercel_project.default will be updated in-place
  ~ resource "vercel_project" "default" {
      ~ environment                = (sensitive value)
        id                         = "prj_ElpLF9P9rDm1zKYmZgFqOjD8x9Ly"
        name                       = "production-web"
      ~ serverless_function_region = "iad1" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*